Revit 2024 API
GroupTypeId.AnalyticalProperties Property
 Analytical Properties.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId AnalyticalProperties { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalProperties As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalProperties {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace